# NewDimension Method (View, Line, ReferenceArray) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ItemFactoryBase..::..NewDimension Method (View, Line, ReferenceArray)
ItemFactoryBase Class Example See Also
---
Creates a new linear dimension object using the default dimension style.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Dimension NewDimension(
	View view,
	Line line,
	ReferenceArray references
)
```

Visual Basic
---
```text
Public Function NewDimension ( _
	view As View, _
	line As Line, _
	references As ReferenceArray _
) As Dimension
```

Visual C++
---
```text
public:
Dimension^ NewDimension(
	View^ view,
	Line^ line,
	ReferenceArray^ references
)
```

# ### Parameters
view
    Type: Autodesk.Revit.DB..::..View The view in which the dimension is to be visible. The view must be nullNothingnullptra null reference (Nothing in Visual Basic) if the document is in [!:Autodesk::Revit::DB::SketchEditScope].
line
    Type: Autodesk.Revit.DB..::..Line The line drawn for the dimension.
references
    Type: Autodesk.Revit.DB..::..ReferenceArray An array of geometric references to which the dimension is to be bound.
# ### Return Value
If successful a new dimension object, otherwise nullNothingnullptra null reference (Nothing in Visual Basic).
# Remarks
The currently user set default style is used for the created dimension.
# Examples
CopyC#
```text
Dimension CreateNewDimensionAlongLine(Autodesk.Revit.DB.Document document, Line line)
{
    // Use the Start and End points of our line as the references
    // Line must come from something in Revit, such as a beam
    ReferenceArray references = new ReferenceArray();
    references.Append(line.GetEndPointReference(0));
    references.Append(line.GetEndPointReference(1));

    // create the new dimension
    Dimension dimension = document.Create.NewDimension(document.ActiveView,
                                                        line, references);
    return dimension;
}
```

CopyVB.NET
```text
Private Function CreateNewDimensionAlongLine(document As Autodesk.Revit.DB.Document, line As Line) As Dimension
    ' Use the Start and End points of our line as the references
    ' Line must come from something in Revit, such as a beam
    Dim references As New ReferenceArray()
    references.Append(line.GetEndPointReference(0))
    references.Append(line.GetEndPointReference(1))

    ' create the new dimension
    Dim dimension As Dimension = document.Create.NewDimension(document.ActiveView, line, references)
    Return dimension
End Function
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when references are not geometric references. |

# See Also
ItemFactoryBase Class
NewDimension Overload
Autodesk.Revit.Creation Namespace